using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Classwork20200302_Army
{
    class Program
    {
        static void Main(string[] args)
        {
           ///////////*Тип: колёсно-гусеничный быстроходный лёгкий по типу «Кристи», с приводом на 6 колёс по типу «Кристи».
           ////////////Боевой вес: 13-14 тонн.
           /*
            Вооружение: 
            * 1 — 45-мм пушка со стабилизатором, 
            * 3 пулемёта ДТ, 
            * огнемёт для самозащиты или 1 — 76-мм пушка, 
            * 3 пулемёта ДТ, огнемёт для самозащиты. 
            Каждый 5-й танк должен иметь зенитную установку.
            
            Боекомплект: 130—150 снарядов 45-мм или 50 снарядов — 76-мм. 
            2500—3000 пулемётных патронов.
            
            Бронирование: 
            Лобовая броня — 25 мм, 
            коническая башня — 20 мм, 
            бортовая броня и корма — 13 мм 16 мм, крыша и дно — 10 мм.
            
            //////////////Скорость движения: на гусеницах и колёсах скорости одинаковые. 
            //////////////Максимальная скорость — 70 км/ч, 
            //////////////минимальная — 7 км/ч.
            
            //////////////Двигатель: дизель ХПЗ — мощность 400 л. с.
            
            //////////////Экипаж: 3 человека.
            
            //////////////Запас хода: 300—400 км на гусеницах.
            //////////////Габариты танка: дорожный просвет 0,4 м на гусеницах. Высота танка 2,3 м.
            //////////////Удельное давление: 0,5 на гусеницах.*/

        }
    }
}
