using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Classwork20200302_Army
{
    class Tank
    {
        /*Тип: колёсно-гусеничный быстроходный лёгкий по типу «Кристи», с приводом на 6 колёс по типу «Кристи».
           Боевой вес: 13-14 тонн.
           Скорость движения: на гусеницах и колёсах скорости одинаковые. 
            Максимальная скорость — 70 км/ч, 
            минимальная — 7 км/ч.
            
            Двигатель: дизель ХПЗ — мощность 400 л. с.
            
            Экипаж: 3 человека.
            
            Запас хода: 300—400 км на гусеницах.
            Габариты танка: дорожный просвет 0,4 м на гусеницах. Высота танка 2,3 м.
            Удельное давление: 0,5 на гусеницах.*/


    }
}
